Tekla Open API Reference for Tekla Structures 2025
LoadTemperature Properties
The LoadTemperature type exposes the following members.
Properties
Name | Description
AutomaticPrimaryAxisWeight |  Obsolete.
 Property not supported in LoadTemperature class.
BoundingBoxDx
 The dimension of the bounding box in the X direction.
 (Inherited from Load.)
BoundingBoxDy
 The dimension of the bounding box in the Y direction.
 (Inherited from Load.)
BoundingBoxDz
 The dimension of the bounding box in the Z direction.
 (Inherited from Load.)
CreateFixedSupportConditionsAutomatically |  Obsolete.
 Property not supported in LoadTemperature class.
FatherId
 The identifier of the father object that the load is attached to.
 (Inherited from Load.)
Group
 The load group object for the load.
 (Inherited from Load.)
Identifier
 The identifier of the object.
 (Inherited from Object.)
InitialAxialElongation
 Gets or sets the initial axial elongation.
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
LoadAttachment
 The load attachment.
 (Inherited from Load.)
LoadDispersionAngle |  Obsolete.
 Property not supported in LoadTemperature class.
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
PartFilter
 The part filter.
 (Inherited from Load.)
PartNames
 The part names.
 (Inherited from Load.)
Position1
 Gets or sets the first input position point.
Position2
 Gets or sets the second input position point.
PrimaryAxisDirection |  Obsolete.
 Property not supported in LoadTemperature class.
Spanning |  Obsolete.
 Property not supported in LoadTemperature class.
TemperatureChangeForAxialElongation
 Gets or sets the temperature change for axial elongation.
TemperatureDifferentialSideToSide
 Gets or sets the temperature differential from side to side.
TemperatureDifferentialTopToBottom
 Gets or sets the temperature differential from top to bottom.
Weight |  Obsolete.
 Property not supported in LoadTemperature class.
Top
See Also
Reference
LoadTemperature Class
Tekla.Structures.Model Namespace